Project/Toir/src/Reports/торо_АнализИспользованияПерсонала/торо_АнализИспользованияПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_АнализИспользованияПерсонала</name>
</mdclass:Report>

Project/Toir/src/AccumulationRegisters/торо_ФактическиеТрудовыеЗатратыРемонтныхРабот/торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ФактическиеТрудовыеЗатратыРемонтныхРабот</name>
  <comment>Фактические трудовые затраты ремонтных работ</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/InformationRegisters/КадроваяИсторияСотрудников/КадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияПоОкончании</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПоОкончании</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписаниюПоОкончании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоОкончании</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоСтавокПоОкончании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидСобытияПоОкончании</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗанятостиПоОкончании</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.ПриемНаРаботу</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/ГрафикРаботыСотрудников/ГрафикРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикРаботыСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботыПоОкончании</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_ОперацииВнешнихОснованийДляРабот</registerRecords>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предписание_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Reports/торо_АнализИспользованияПерсонала/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	ТабДанныхДляСКД = ПолучитьДанныеДляСКД(НастройкиОсновнойСхемы);
	НастроитьДополнениеПоПериоду(НастройкиОсновнойСхемы);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОсновнойСхемы, ДанныеРасшифровки);
	
	ВнешниеНаборы = Новый Структура("ВнешнийНабор", ТабДанныхДляСКД);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки, Истина);
	
	ПроцессорВыводаВТабличныйДокумент = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаВТабличныйДокумент.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаВТабличныйДокумент.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляСКД(НастройкиОсновнойСхемы)
	
	ПараметрыОтчетаСтруктура = ПолучитьПараметрыОтчета(НастройкиОсновнойСхемы);
	
	МенеджерВТ = ПолучитьОсновныеДанныеДляОтчета(НастройкиОсновнойСхемы, ПараметрыОтчетаСтруктура);
	ПериодОтчета = ПолучитьПериодОтчетаРеальный(МенеджерВТ);
	Графики = ПолучитьГрафикиДляРасчета(МенеджерВТ);
	ГрафикиРаботы.СоздатьВТРасписанияРаботыНаПериод(МенеджерВТ, Графики, ПериодОтчета.ДатаНачала, ПериодОтчета.ДатаОкончания);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫБОР &Периодичность
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, ДЕНЬ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, МЕСЯЦ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, ГОД)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, КВАРТАЛ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, НЕДЕЛЯ)
	                      |	КОНЕЦ КАК ДатаГрафика,
	                      |	СУММА(РАЗНОСТЬДАТ(ВТРасписанияРаботы.ВремяНачала, ВТРасписанияРаботы.ВремяОкончания, СЕКУНДА)) КАК ВремяВСекундах,
	                      |	ДатыДействияГрафиковПоСотрудникамВРамкахПериодаОтчета.Сотрудник КАК Сотрудник
	                      |ПОМЕСТИТЬ ПлановоеВремяРаботыСотрудников
	                      |ИЗ
	                      |	ДатыДействияГрафиковПоСотрудникамВРамкахПериодаОтчета КАК ДатыДействияГрафиковПоСотрудникамВРамкахПериодаОтчета
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасписанияРаботы КАК ВТРасписанияРаботы
	                      |		ПО ДатыДействияГрафиковПоСотрудникамВРамкахПериодаОтчета.ГрафикРаботы = ВТРасписанияРаботы.ГрафикРаботы
	                      |			И (ВТРасписанияРаботы.ДатаГрафика МЕЖДУ ДатыДействияГрафиковПоСотрудникамВРамкахПериодаОтчета.ДатаНачала И ДатыДействияГрафиковПоСотрудникамВРамкахПериодаОтчета.ДатаОкончания)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЫБОР &Периодичность
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, ДЕНЬ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, МЕСЯЦ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, ГОД)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, КВАРТАЛ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ВТРасписанияРаботы.ДатаГрафика, НЕДЕЛЯ)
	                      |	КОНЕЦ,
	                      |	ДатыДействияГрафиковПоСотрудникамВРамкахПериодаОтчета.Сотрудник
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.ОбъектРемонта КАК ОбъектРемонта,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.ВидРемонта КАК ВидРемонта
	                      |ПОМЕСТИТЬ ВТ_ОбъектыИВидыРемонта
	                      |ИЗ
	                      |	ФактЗатратыВРазрезеОбъектовИВидов КАК ФактЗатратыВРазрезеОбъектовИВидов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.ОбъектРемонта КАК ОбъектРемонта,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.ВидРемонта КАК ВидРемонта,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.Сотрудник КАК Сотрудник
	                      |ПОМЕСТИТЬ ВТ_СотрудникиСРемонтами
	                      |ИЗ
	                      |	ФактЗатратыВРазрезеОбъектовИВидов КАК ФактЗатратыВРазрезеОбъектовИВидов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПлановоеВремяРаботыСотрудников.ДатаГрафика КАК ДатаГрафика,
	                      |	ПлановоеВремяРаботыСотрудников.ВремяВСекундах КАК ВремяРаботыПлан,
	                      |	ПлановоеВремяРаботыСотрудников.Сотрудник КАК Сотрудник,
	                      |	ВТ_ОбъектыИВидыРемонта.ОбъектРемонта КАК ОбъектРемонта,
	                      |	ВТ_ОбъектыИВидыРемонта.ВидРемонта КАК ВидРемонта
	                      |ПОМЕСТИТЬ ВТ_ПлановоеВремя
	                      |ИЗ
	                      |	ПлановоеВремяРаботыСотрудников КАК ПлановоеВремяРаботыСотрудников,
	                      |	ВТ_ОбъектыИВидыРемонта КАК ВТ_ОбъектыИВидыРемонта
	                      |ГДЕ
	                      |	ПлановоеВремяРаботыСотрудников.Сотрудник В
	                      |			(ВЫБРАТЬ
	                      |				ВТ_СотрудникиСРемонтами.Сотрудник КАК Сотрудник
	                      |			ИЗ
	                      |				ВТ_СотрудникиСРемонтами КАК ВТ_СотрудникиСРемонтами)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.ОбъектРемонта КАК ОбъектРемонта,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.ВидРемонта КАК ВидРемонта,
	                      |	СУММА(ФактЗатратыВРазрезеОбъектовИВидов.ВремяРаботы) КАК ВремяРаботыФакт,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.Сотрудник КАК Сотрудник,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.Период КАК Период
	                      |ПОМЕСТИТЬ ВТ_Сумма
	                      |ИЗ
	                      |	ФактЗатратыВРазрезеОбъектовИВидов КАК ФактЗатратыВРазрезеОбъектовИВидов
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.ОбъектРемонта,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.ВидРемонта,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.Сотрудник,
	                      |	ФактЗатратыВРазрезеОбъектовИВидов.Период
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ПлановоеВремя.Сотрудник КАК Сотрудник,
	                      |	ВТ_ПлановоеВремя.ДатаГрафика КАК Период,
	                      |	МАКСИМУМ(ВТ_ПлановоеВремя.ВремяРаботыПлан) КАК ВремяРаботыПлан,
	                      |	ЕСТЬNULL(ВТ_Сумма.ОбъектРемонта, ВТ_ПлановоеВремя.ОбъектРемонта) КАК ОбъектРемонта,
	                      |	ЕСТЬNULL(ВТ_Сумма.ВидРемонта, ВТ_ПлановоеВремя.ВидРемонта) КАК ВидРемонта,
	                      |	МАКСИМУМ(ВТ_Сумма.ВремяРаботыФакт) КАК ВремяРаботыФакт
	                      |ПОМЕСТИТЬ ВТ_Итоговая
	                      |ИЗ
	                      |	ВТ_ПлановоеВремя КАК ВТ_ПлановоеВремя
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сумма КАК ВТ_Сумма
	                      |		ПО ВТ_ПлановоеВремя.Сотрудник = ВТ_Сумма.Сотрудник
	                      |			И ВТ_ПлановоеВремя.ОбъектРемонта = ВТ_Сумма.ОбъектРемонта
	                      |			И ВТ_ПлановоеВремя.ДатаГрафика = ВТ_Сумма.Период
	                      |			И ВТ_ПлановоеВремя.ВидРемонта = ВТ_Сумма.ВидРемонта
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_ПлановоеВремя.Сотрудник,
	                      |	ВТ_ПлановоеВремя.ДатаГрафика,
	                      |	ЕСТЬNULL(ВТ_Сумма.ОбъектРемонта, ВТ_ПлановоеВремя.ОбъектРемонта),
	                      |	ЕСТЬNULL(ВТ_Сумма.ВидРемонта, ВТ_ПлановоеВремя.ВидРемонта)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Итоговая.Сотрудник КАК Сотрудник,
	                      |	ВТ_Итоговая.Период КАК Период,
	                      |	ВТ_Итоговая.ВремяРаботыПлан КАК ВремяРаботыПлан,
	                      |	ВТ_Итоговая.ОбъектРемонта КАК ОбъектРемонта,
	                      |	ВТ_Итоговая.ВидРемонта КАК ВидРемонта,
	                      |	ВТ_Итоговая.ВремяРаботыФакт КАК ВремяРаботыФакт
	                      |ИЗ
	                      |	ВТ_Итоговая КАК ВТ_Итоговая
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СотрудникиСРемонтами КАК ВТ_СотрудникиСРемонтами
	                      |		ПО ВТ_Итоговая.Сотрудник = ВТ_СотрудникиСРемонтами.Сотрудник
	                      |			И ВТ_Итоговая.ОбъектРемонта = ВТ_СотрудникиСРемонтами.ОбъектРемонта
	                      |			И ВТ_Итоговая.ВидРемонта = ВТ_СотрудникиСРемонтами.ВидРемонта");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.УстановитьПараметр("Периодичность", ПараметрыОтчетаСтруктура.Периодичность);
	
	ГрафикиРаботыРасч = Запрос.Выполнить().Выгрузить();
	
	МенеджерВТ.Закрыть();
	Возврат ГрафикиРаботыРасч;
	
КонецФункции

Функция ПолучитьОсновныеДанныеДляОтчета(НастройкиОсновнойСхемы, ПараметрыОтчетаСтруктура)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	торо_Ремонты.ID КАК ID
	                      |ПОМЕСТИТЬ ОтборПоВидамДокументов
	                      |ИЗ
	                      |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	                      |		ПО (торо_Ремонты.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
	                      |				ИЛИ НЕ торо_Ремонты.ОбъектРемонта ССЫЛКА Справочник.торо_ОбъектыРемонта)
	                      |ГДЕ
	                      |	(&ПоППР
	                      |				И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта
	                      |			ИЛИ &ПоПредписаниям
	                      |				И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот
	                      |			ИЛИ &ПоВыявленнымДефектам
	                      |				И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты
	                      |			ИЛИ &ПоРегламентнымМероприятиям
	                      |				И торо_Ремонты.Регистратор ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID КАК РемонтыОборудования_ID,
	                      |	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Квалификация КАК Квалификация,
	                      |	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Сотрудник КАК Сотрудник,
	                      |	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.ВремяРаботы КАК ВремяРаботы,
	                      |	торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Период КАК Период
	                      |ПОМЕСТИТЬ ФактЗатраты
	                      |ИЗ
	                      |	РегистрНакопления.торо_ФактическиеТрудовыеЗатратыРемонтныхРабот КАК торо_ФактическиеТрудовыеЗатратыРемонтныхРабот
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОтборПоВидамДокументов КАК ОтборПоВидамДокументов
	                      |		ПО торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.РемонтыОборудования_ID = ОтборПоВидамДокументов.ID
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ПараметрПериодИспользуется
	                      |				ТОГДА торо_ФактическиеТрудовыеЗатратыРемонтныхРабот.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(МИНИМУМ(ВЫБОР
	                      |				КОГДА &ПараметрПериодИспользуется
	                      |					ТОГДА &ДатаНачала
	                      |				ИНАЧЕ ФактЗатраты.Период
	                      |			КОНЕЦ), &ДатаНачала) КАК ДатаНачала,
	                      |	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	                      |				КОГДА &ПараметрПериодИспользуется
	                      |					ТОГДА &ДатаОкончания
	                      |				ИНАЧЕ ФактЗатраты.Период
	                      |			КОНЕЦ), &ДатаОкончания) КАК ДатаОкончания
	                      |ПОМЕСТИТЬ ПериодОтчета
	                      |ИЗ
	                      |	ФактЗатраты КАК ФактЗатраты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
	                      |	МИНИМУМ(ВЫБОР
	                      |			КОГДА КадроваяИсторияСотрудников.Регистратор ССЫЛКА Документ.Увольнение
	                      |					И КадроваяИсторияСотрудников.Период <= ПериодОтчета.ДатаОкончания
	                      |				ТОГДА КадроваяИсторияСотрудников.Период
	                      |			ИНАЧЕ ПериодОтчета.ДатаОкончания
	                      |		КОНЕЦ) КАК ДатаОкончанияПериодаОтчетаИлиУвольнения,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА КадроваяИсторияСотрудников.Период <= ПериодОтчета.ДатаНачала
	                      |				ТОГДА КадроваяИсторияСотрудников.Период
	                      |			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	                      |		КОНЕЦ) КАК ДатаПервогоДокументаГрафикаРаботы
	                      |ПОМЕСТИТЬ ДатыДляПолученияГрафиков
	                      |ИЗ
	                      |	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников,
	                      |	ПериодОтчета КАК ПериодОтчета
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	КадроваяИсторияСотрудников.Сотрудник
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ГрафикРаботыСотрудников.Сотрудник КАК Сотрудник,
	                      |	ГрафикРаботыСотрудников.ГрафикРаботы КАК ГрафикРаботы,
	                      |	ГрафикРаботыСотрудников.Период КАК Период
	                      |ПОМЕСТИТЬ ГрафикиПоСотрудникам
	                      |ИЗ
	                      |	РегистрСведений.ГрафикРаботыСотрудников КАК ГрафикРаботыСотрудников
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыДляПолученияГрафиков КАК ДатыДляПолученияГрафиков
	                      |			ПОЛНОЕ СОЕДИНЕНИЕ ПериодОтчета КАК ПериодОтчета
	                      |			ПО (ИСТИНА)
	                      |		ПО ГрафикРаботыСотрудников.Сотрудник = ДатыДляПолученияГрафиков.Сотрудник
	                      |			И (ГрафикРаботыСотрудников.Период МЕЖДУ НАЧАЛОПЕРИОДА(ВЫБОР
	                      |					КОГДА ДатыДляПолученияГрафиков.ДатаПервогоДокументаГрафикаРаботы = ДАТАВРЕМЯ(1, 1, 1)
	                      |						ТОГДА ПериодОтчета.ДатаНачала
	                      |					ИНАЧЕ ДатыДляПолученияГрафиков.ДатаПервогоДокументаГрафикаРаботы
	                      |				КОНЕЦ, ДЕНЬ) И ДатыДляПолученияГрафиков.ДатаОкончанияПериодаОтчетаИлиУвольнения)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ГрафикиПоСотрудникам.Сотрудник КАК Сотрудник,
	                      |	ГрафикиПоСотрудникам.ГрафикРаботы КАК ГрафикРаботы,
	                      |	ВЫБОР
	                      |		КОГДА ГрафикиПоСотрудникам.Период < ПериодОтчета.ДатаНачала
	                      |			ТОГДА ПериодОтчета.ДатаНачала
	                      |		ИНАЧЕ НАЧАЛОПЕРИОДА(ГрафикиПоСотрудникам.Период, ДЕНЬ)
	                      |	КОНЕЦ КАК ДатаНачала,
	                      //|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЕСТЬNULL(ГрафикиПоСотрудникам1.Период, ДатыДляПолученияГрафиков.ДатаОкончанияПериодаОтчетаИлиУвольнения), ДЕНЬ), СЕКУНДА, -1)) КАК ДатаОкончания
						  |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЕСТЬNULL(ГрафикиПоСотрудникам1.Период, ДатыДляПолученияГрафиков.ДатаОкончанияПериодаОтчетаИлиУвольнения), ДЕНЬ), СЕКУНДА, 1)) КАК ДатаОкончания
	                      |ПОМЕСТИТЬ ДатыДействияГрафиковПоСотрудникамВРамкахПериодаОтчета
	                      |ИЗ
	                      |	ГрафикиПоСотрудникам КАК ГрафикиПоСотрудникам
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикиПоСотрудникам КАК ГрафикиПоСотрудникам1
	                      |		ПО ГрафикиПоСотрудникам.Сотрудник = ГрафикиПоСотрудникам1.Сотрудник
	                      |			И ГрафикиПоСотрудникам.Период < ГрафикиПоСотрудникам1.Период
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыДляПолученияГрафиков КАК ДатыДляПолученияГрафиков
	                      |		ПО ГрафикиПоСотрудникам.Сотрудник = ДатыДляПолученияГрафиков.Сотрудник,
	                      |	ПериодОтчета КАК ПериодОтчета
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ГрафикиПоСотрудникам.Сотрудник,
	                      |	ГрафикиПоСотрудникам.ГрафикРаботы,
	                      |	ВЫБОР
	                      |		КОГДА ГрафикиПоСотрудникам.Период < ПериодОтчета.ДатаНачала
	                      |			ТОГДА ПериодОтчета.ДатаНачала
	                      |		ИНАЧЕ НАЧАЛОПЕРИОДА(ГрафикиПоСотрудникам.Период, ДЕНЬ)
	                      |	КОНЕЦ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	торо_РемонтыСрезПоследних.ID КАК ID,
	                      |	МАКСИМУМ(торо_РемонтыСрезПоследних.ОбъектРемонта) КАК ОбъектРемонта,
	                      |	МАКСИМУМ(торо_РемонтыСрезПоследних.ВидРемонта) КАК ВидРемонта
	                      |ПОМЕСТИТЬ ВидыИОбъектыРемонтов
	                      |ИЗ
	                      |	РегистрСведений.торо_Ремонты.СрезПоследних(
	                      |			,
	                      |			ID В
	                      |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |					ФактЗатраты.РемонтыОборудования_ID
	                      |				ИЗ
	                      |					ФактЗатраты КАК ФактЗатраты)) КАК торо_РемонтыСрезПоследних
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	торо_РемонтыСрезПоследних.ID
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЫБОР &Периодичность
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, ДЕНЬ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, МЕСЯЦ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, ГОД)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, КВАРТАЛ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, НЕДЕЛЯ)
	                      |	КОНЕЦ КАК Период,
	                      |	ВидыИОбъектыРемонтов.ОбъектРемонта КАК ОбъектРемонта,
	                      |	ВидыИОбъектыРемонтов.ВидРемонта КАК ВидРемонта,
	                      |	ФактЗатраты.Сотрудник КАК Сотрудник,
	                      |	СУММА(ФактЗатраты.ВремяРаботы) КАК ВремяРаботы
	                      |ПОМЕСТИТЬ ФактЗатратыВРазрезеОбъектовИВидов
	                      |ИЗ
	                      |	ФактЗатраты КАК ФактЗатраты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВидыИОбъектыРемонтов КАК ВидыИОбъектыРемонтов
	                      |		ПО ФактЗатраты.РемонтыОборудования_ID = ВидыИОбъектыРемонтов.ID
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ФактЗатраты.Сотрудник,
	                      |	ВидыИОбъектыРемонтов.ВидРемонта,
	                      |	ВидыИОбъектыРемонтов.ОбъектРемонта,
	                      |	ВЫБОР &Периодичность
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, ДЕНЬ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, МЕСЯЦ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, ГОД)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, КВАРТАЛ)
	                      |		КОГДА ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	                      |			ТОГДА НАЧАЛОПЕРИОДА(ФактЗатраты.Период, НЕДЕЛЯ)
	                      |	КОНЕЦ");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	КоллекцияПараметров = НастройкиОсновнойСхемы.ПараметрыДанных.Элементы;
	ПараметрПериод = КоллекцияПараметров.Найти("ПериодОтчета");
	ИспользованиеПериода = ПараметрПериод.Использование;
	Запрос.УстановитьПараметр("ПараметрПериодИспользуется", ИспользованиеПериода);
	Запрос.УстановитьПараметр("ДатаНачала", ?(ИспользованиеПериода, ПараметрПериод.Значение.ДатаНачала, Дата(1,1,1)));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ИспользованиеПериода, ПараметрПериод.Значение.ДатаОкончания, Дата(1,1,1)));
	Запрос.УстановитьПараметр("Периодичность",ПараметрыОтчетаСтруктура.Периодичность);
	Запрос.УстановитьПараметр("ПоРегламентнымМероприятиям",ПараметрыОтчетаСтруктура.ПоРегламентнымМероприятиям);
	Запрос.УстановитьПараметр("ПоППР",ПараметрыОтчетаСтруктура.ПоППР);
	Запрос.УстановитьПараметр("ПоПредписаниям",ПараметрыОтчетаСтруктура.ПоПредписаниям);
	Запрос.УстановитьПараметр("ПоВыявленнымДефектам",ПараметрыОтчетаСтруктура.ПоВыявленнымДефектам);
	
	ЗаполнитьЗначенияСвойств(Запрос.Параметры, ПараметрыОтчетаСтруктура);
	Запрос.Выполнить();
	Возврат МенеджерВТ;
	
КонецФункции

Функция ПолучитьПериодОтчетаРеальный(МенеджерВТ)
	
	СтруктураВозврата = Новый Структура("ДатаНачала, ДатаОкончания");
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПериодОтчета.ДатаНачала,
	|	ПериодОтчета.ДатаОкончания
	|ИЗ
	|	ПериодОтчета КАК ПериодОтчета");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	Иначе
		СтруктураВозврата.ДатаНачала = Дата(1, 1, 1);
		СтруктураВозврата.ДатаОкончания = Дата(1, 1, 1);
	КонецЕсли;
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьГрафикиДляРасчета(МенеджерВТ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикиПоСотрудникам.ГрафикРаботы
	|ИЗ
	|	ГрафикиПоСотрудникам КАК ГрафикиПоСотрудникам");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГрафикРаботы");
	
КонецФункции

Функция ПолучитьПараметрыОтчета(НастройкиОсновнойСхемы)
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Периодичность", НастройкиОсновнойСхемы.ПараметрыДанных.Элементы.Найти("Периодичность").Значение);
	ПараметрыОтчета.Вставить("ПоРегламентнымМероприятиям",НастройкиОсновнойСхемы.ПараметрыДанных.Элементы.Найти("ПоРегламентнымМероприятиям").Значение);
	ПараметрыОтчета.Вставить("ПоППР",НастройкиОсновнойСхемы.ПараметрыДанных.Элементы.Найти("ПоППР").Значение);
	ПараметрыОтчета.Вставить("ПоПредписаниям",НастройкиОсновнойСхемы.ПараметрыДанных.Элементы.Найти("ПоПредписаниям").Значение);
	ПараметрыОтчета.Вставить("ПоВыявленнымДефектам",НастройкиОсновнойСхемы.ПараметрыДанных.Элементы.Найти("ПоВыявленнымДефектам").Значение);
	Возврат ПараметрыОтчета;
	
КонецФункции


Процедура НастроитьДополнениеПоПериоду(НастройкиСхемы)
	
	ПолеГруппировки = ПолучитьПолеГруппировкиКомпоновкиДанныхДляНастройкиДополнения(НастройкиСхемы, "Период");
	ПараметрПериодичностьОтчета = НастройкиСхемы.ПараметрыДанных.Элементы.Найти("Периодичность");
	ТипДополненияПериодаПеречисление = ПараметрПериодичностьОтчета.Значение;
	Если ПолеГруппировки <> Неопределено И ПараметрПериодичностьОтчета <> Неопределено Тогда
		ТипДополненияПериодаПеречисление = ПараметрПериодичностьОтчета.Значение;
		УстановитьТипДополненияПериодаДляПоляГруппировки(ПолеГруппировки, НастройкиСхемы,ТипДополненияПериодаПеречисление);
		УстановитьДатыНачалаИОкончанияДополнения(ПолеГруппировки, НастройкиСхемы,ТипДополненияПериодаПеречисление);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПолеГруппировкиКомпоновкиДанныхДляНастройкиДополнения(НастройкиСхемы, ИмяГруппировки)
	
	Для Каждого ЭлементНастройки Из НастройкиСхемы.Структура Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Для Каждого Колонка Из ЭлементНастройки.Колонки Цикл
				Если Колонка.Имя = ИмяГруппировки Тогда
					Возврат Колонка.ПоляГруппировки.Элементы[0];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура УстановитьТипДополненияПериодаДляПоляГруппировки(ПолеГруппировкиКомпоновкиДанных, НастройкиСхемы, ТипДополненияПериодаПеречисление)

	Если ТипДополненияПериодаПеречисление = Перечисления.Периодичность.Месяц Тогда
		ПолеГруппировкиКомпоновкиДанных.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Месяц;
	ИначеЕсли ТипДополненияПериодаПеречисление = Перечисления.Периодичность.День Тогда
		ПолеГруппировкиКомпоновкиДанных.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.День;
	ИначеЕсли ТипДополненияПериодаПеречисление = Перечисления.Периодичность.Год Тогда
		ПолеГруппировкиКомпоновкиДанных.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Год;
	ИначеЕсли ТипДополненияПериодаПеречисление = Перечисления.Периодичность.Квартал Тогда
		ПолеГруппировкиКомпоновкиДанных.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Квартал;
	ИначеЕсли ТипДополненияПериодаПеречисление = Перечисления.Периодичность.Неделя Тогда
		ПолеГруппировкиКомпоновкиДанных.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.Неделя;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатыНачалаИОкончанияДополнения(ПолеГруппировкиКомпоновкиДанных, НастройкиСхемы,ТипДополненияПериодаПеречисление)

	ПараметрПериодОтчета = НастройкиСхемы.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	
	Если ПараметрПериодОтчета <> Неопределено И ПараметрПериодОтчета.Использование Тогда
		
		Если ТипДополненияПериодаПеречисление = Перечисления.Периодичность.Месяц Тогда
			ПолеГруппировкиКомпоновкиДанных.НачалоПериода = НачалоМесяца(ПараметрПериодОтчета.Значение.ДатаНачала);
			ПолеГруппировкиКомпоновкиДанных.КонецПериода = КонецМесяца(ПараметрПериодОтчета.Значение.ДатаОкончания);
		ИначеЕсли ТипДополненияПериодаПеречисление = Перечисления.Периодичность.День Тогда
			ПолеГруппировкиКомпоновкиДанных.НачалоПериода = ПараметрПериодОтчета.Значение.ДатаНачала;
			ПолеГруппировкиКомпоновкиДанных.КонецПериода = ПараметрПериодОтчета.Значение.ДатаОкончания;
		ИначеЕсли ТипДополненияПериодаПеречисление = Перечисления.Периодичность.Год Тогда
			ПолеГруппировкиКомпоновкиДанных.НачалоПериода = НачалоГода(ПараметрПериодОтчета.Значение.ДатаНачала);
			ПолеГруппировкиКомпоновкиДанных.КонецПериода = КонецГода(ПараметрПериодОтчета.Значение.ДатаОкончания);
		ИначеЕсли ТипДополненияПериодаПеречисление = Перечисления.Периодичность.Квартал Тогда
			ПолеГруппировкиКомпоновкиДанных.НачалоПериода = НачалоКвартала(ПараметрПериодОтчета.Значение.ДатаНачала);
			ПолеГруппировкиКомпоновкиДанных.КонецПериода = КонецКвартала(ПараметрПериодОтчета.Значение.ДатаОкончания);
		ИначеЕсли ТипДополненияПериодаПеречисление = Перечисления.Периодичность.Неделя Тогда
			ПолеГруппировкиКомпоновкиДанных.НачалоПериода = НачалоНедели(ПараметрПериодОтчета.Значение.ДатаНачала);
			ПолеГруппировкиКомпоновкиДанных.КонецПериода = КонецНедели(ПараметрПериодОтчета.Значение.ДатаОкончания);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
